Revit 2024 API
Wall.GetStackedWallMemberIds Method
 Get the sub walls which belongs to the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public IList<ElementId> GetStackedWallMemberIds()
Visual Basic
Public Function GetStackedWallMemberIds As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetStackedWallMemberIds()
Return Value
 If the wall is a stacked wall, the Ids of the sub will be returned in bottom-top order.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This wall isn't a consistent stacked wall.
See Also
Wall Class
Autodesk.Revit.DB Namespace